[
  {
    "id": 1,
    "title": "12 Tips for Starting a Travel Blog: What I’ve Learned After 3 Years",
    "excerpt": "Practical, honest advice I wish I had known when I started my own blogging & travel adventure.",
    "category": "Travel",
    "author": "Lynne Lessard",
    "date": "2023-11-12",
    "readTime": "approx 8 min",
    "content": "Starting a travel blog can feel overwhelming, but with a few key strategies, it becomes manageable and rewarding. Focus on your niche, create authentic content, and engage with your readers consistently. Remember, photography and storytelling are equally important—combine them to make your blog stand out.",
    "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e"
  },
  {
    "id": 2,
    "title": "My Life as a Travel Blogger: An Unexpected Journey",
    "excerpt": "From clinical career to full-time travel blogging, this is the story of one site’s evolution.",
    "category": "Travel",
    "author": "Julie & Tim",
    "date": "2025-10-12",
    "readTime": "approx 10 min",
    "content": "Transitioning from a traditional career to travel blogging wasn’t easy, but the lessons learned along the way were invaluable. Building an audience, mastering SEO, and learning photography were crucial steps. Beyond the technical side, the personal growth and experiences made the journey unforgettable.",
    "image": "https://images.unsplash.com/photo-1526779259212-0c8f6b8e0c6f"
  },
  {
    "id": 3,
    "title": "50 Blog Post Ideas For Food Bloggers",
    "excerpt": "A huge list of ideas to keep your food blogging fresh and engaging.",
    "category": "Food",
    "author": "New Lune",
    "date": "2020-07-03",
    "readTime": "approx 5 min",
    "content": "If you’re struggling with writer’s block, inspiration is closer than you think. From recipe experiments to restaurant reviews, seasonal ingredients, and behind-the-scenes cooking tips, this list ensures you’ll never run out of fresh content ideas.",
    "image": "https://images.unsplash.com/photo-1511689660979-81867b78266d"
  },
  {
    "id": 4,
    "title": "23+ Amazing Food Blog Examples for Design Inspiration",
    "excerpt": "Explore standout food blogs and learn what makes their design and content successful.",
    "category": "Food",
    "author": "BlogTyrant",
    "date": "2024-07-14",
    "readTime": "approx 6 min",
    "content": "Successful food blogs combine aesthetics with functionality. Consider layout, typography, and color schemes that enhance readability. Highlighting high-quality images and offering clear navigation keeps readers engaged.",
    "image": "https://images.unsplash.com/photo-1504674900247-0877df9cc836"
  },
  {
    "id": 5,
    "title": "221 Lifestyle Blog Post Ideas for Lifestyle Bloggers",
    "excerpt": "An extensive list of lifestyle topics spanning health, wellness, digital content and more.",
    "category": "Lifestyle",
    "author": "Feather.so",
    "date": "2025-02-18",
    "readTime": "approx 7 min",
    "content": "Lifestyle blogging is vast, covering health routines, productivity hacks, fashion trends, and digital lifestyle tips. Experimenting with different formats—how-to guides, listicles, and personal stories—helps maintain engagement and keeps your content fresh.",
    "image": "https://images.unsplash.com/photo-1526403221525-0c6b69a364f8"
  },
  {
    "id": 6,
    "title": "Beginner’s Guide to Travel Blogging: Top 12 Tips",
    "excerpt": "Essential insights from a travel blogger who’s been there and done that.",
    "category": "Travel",
    "author": "Lynne Lessard",
    "date": "2023-11-12",
    "readTime": "approx 8 min",
    "content": "From choosing a platform to planning your content calendar, these 12 tips give beginners the confidence to launch a blog. Prioritize authentic storytelling, network with fellow bloggers, and focus on high-quality visuals to grow your audience organically.",
    "image": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0"
  },
  {
    "id": 7,
    "title": "The Open Travel Blog: A Traveller-led Community",
    "excerpt": "A blogging community where travellers share real experiences and stories from around the world.",
    "category": "Travel",
    "author": "Open Travel Blog Community",
    "date": "2024-01-01",
    "readTime": "approx 5 min",
    "content": "Community-driven platforms allow bloggers to collaborate, share insights, and inspire one another. Whether it’s hidden gems, budget tips, or cultural experiences, readers value diverse voices that bring destinations to life.",
    "image": "https://images.unsplash.com/photo-1483683804023-6ccdb62f86ef"
  },
  {
    "id": 8,
    "title": "Structuring the Perfect Recipe Blog Post",
    "excerpt": "How to craft blog posts for recipes with SEO, readability and user engagement in mind.",
    "category": "Food",
    "author": "Emily @ FBP",
    "date": "2024-02-01",
    "readTime": "approx 5 min",
    "content": "The best recipe posts balance clarity, structure, and aesthetics. Include step-by-step instructions, high-quality images, and tips for substitutions. Engaging titles, keywords, and meta descriptions improve discoverability while keeping readers coming back.",
    "image": "https://images.unsplash.com/photo-1546069901-ba9599a7e63c"
  },
  {
    "id": 9,
    "title": "The Woks of Life: A Chinese-American Family Food Blog",
    "excerpt": "A family’s food blog celebrating heritage, cooking and sharing Chinese-American recipes.",
    "category": "Food",
    "author": "Sarah, Kaitlin, Judy & Bill Leung",
    "date": "2013-03-01",
    "readTime": "approx 7 min",
    "content": "Sharing family recipes and stories creates a sense of tradition and community. This blog highlights authentic Chinese-American cuisine, blending cultural heritage with modern cooking techniques. Each post tells a story while offering practical cooking advice.",
    "image": "https://images.unsplash.com/photo-1525755662778-989d0524087e"
  },
  {
    "id": 10,
    "title": "Top 50 Food Blogs & Bloggers (IndustryEats)",
    "excerpt": "A curated overview of the top food blogs and what makes them stand out in the industry.",
    "category": "Food",
    "author": "IndustryEats",
    "date": "2024-01-01",
    "readTime": "approx 6 min",
    "content": "Top food blogs differentiate themselves through unique perspectives, consistent content, and engaging visuals. By analyzing these blogs, aspiring creators can learn strategies for growth, audience engagement, and recipe presentation.",
    "image": "https://images.unsplash.com/photo-1504674900247-0877df9cc836"
  }
]
